import styles from "./page.module.css";

export default function Home() {
  return (
    <main className={styles.main}>
      <pre className={styles.pre}>
        {`
1. 일반
이 개인정보 처리방침은 사용자가 업비트 거래소의 실시간 암호화폐 가격 정보를 추적하고 관리할 수 있도록 지원하는 확장 프로그램(이하 "서비스")의 사용과 관련하여, 사용자의 개인정보를 보호하기 위해 마련되었습니다. 본 서비스는 사용자의 개인정보를 절대 수집하지 않으며, 사용자 데이터를 보호하고 신뢰를 유지하기 위해 최선을 다하고 있습니다.

2. 수집하는 개인정보의 항목
본 서비스는 사용자의 개인정보를 수집하지 않습니다.

3. 개인정보의 수집 및 이용 목적
본 서비스는 사용자의 개인정보를 수집하거나 이용하지 않습니다. 모든 데이터는 사용자의 브라우저 로컬 스토리지에 저장되며, 외부 서버로 전송되지 않습니다.

4. 개인정보의 제3자 제공
본 서비스는 사용자의 개인정보를 제3자에게 제공하지 않습니다.

5. 개인정보의 보유 및 이용 기간
본 서비스는 사용자의 개인정보를 수집하지 않으므로, 개인정보의 보유 및 이용 기간이 적용되지 않습니다.

6. 개인정보의 파기
본 서비스는 사용자의 개인정보를 수집하지 않으므로, 개인정보의 파기 절차와 방법이 적용되지 않습니다.

7. 개인정보의 안전성 확보 조치
본 서비스는 개인정보를 수집하지 않으므로, 개인정보의 안전성 확보 조치가 필요하지 않습니다. 다만, 사용자의 설정 및 선호 데이터를 안전하게 보호하기 위해 로컬 스토리지를 안전하게 관리합니다.

8. 이용자의 권리와 그 행사 방법
사용자는 언제든지 본 서비스의 개인정보 처리방침을 확인할 수 있으며, 개인정보 보호와 관련된 권리를 행사할 필요가 없습니다. 본 서비스는 개인정보를 수집하지 않기 때문에 별도의 권리 행사가 필요하지 않습니다.

9. 개인정보 보호책임자 및 담당자
본 서비스는 개인정보를 수집하지 않으므로, 개인정보 보호책임자 및 담당자가 필요하지 않습니다. 그러나 서비스와 관련된 문의 사항이 있을 경우, 아래의 연락처로 문의해 주시기 바랍니다.

이메일: alsrn0215@gmail.com

10. 쿠키(Cookie)의 운영에 관한 사항
본 서비스는 쿠키를 사용하지 않습니다.

11. 기타
본 개인정보 처리방침은 관련 법령 및 본 서비스의 정책에 따라 변경될 수 있으며, 변경 사항은 업데이트 내역을 통해 공지됩니다.

12. 부칙
본 개인정보 처리방침은 2024년 8월 6일부터 적용됩니다.

본 개인정보 처리방침은 사용자의 편의를 위해 작성되었으며, 본 서비스를 설치하고 사용하는 것은 위 방침에 동의하는 것으로 간주됩니다.`}
      </pre>
    </main>
  );
}
